# 常用操作

In [4]:
import pandas as pd
data=pd.DataFrame({'group':['a','a','a','b','b','b','c','c','c'],'data':[4,3,2,1,12,3,4,5,7]})
data

  group  data
0     a     4
1     a     3
2     a     2
3     b     1
4     b    12
5     b     3
6     c     4
7     c     5
8     c     7

In [20]:
data.sort_values(by=['group','data'],ascending=[False,True],inplace=True)
data

  group  data
6     c     4
7     c     5
8     c     7
3     b     1
5     b     3
4     b    12
2     a     2
1     a     3
0     a     4

In [24]:
data=pd.DataFrame({'k1':['one']*3 + ['two']*4,'k2':[3,2,1,3,3,4,4]})
data

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
4  two   3
5  two   4
6  two   4

In [30]:
data.sort_values(by='k2')

    k1  k2
2  one   1
1  one   2
0  one   3
3  two   3
4  two   3
5  two   4
6  two   4

In [32]:
# 去重
data.drop_duplicates()

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
5  two   4

In [34]:
# 特征k1去重
data.drop_duplicates(subset='k1')

    k1  k2
0  one   3
3  two   3

In [38]:
data=pd.DataFrame({'food':['A1','A2','B1','B2','B3','C1','C2'],'data':[1,2,3,4,5,6,7]})
data

  food  data
0   A1     1
1   A2     2
2   B1     3
3   B2     4
4   B3     5
5   C1     6
6   C2     7

In [52]:
def food_map(series):
    if series['food'] == 'A1':
        return 'A'
    elif series['food'] == 'A2':
         return 'A'
    elif series['food'] == 'B1':
         return 'B'
    elif series['food'] == 'B2':
         return 'B'
    elif series['food'] == 'B3':
         return 'B'
    elif series['food'] == 'C1':
         return 'C'
    elif series['food'] == 'C2':
         return 'C'

data['food_map']=data.apply(food_map,axis='columns')
data

In [56]:
food2Upper={
    'A1':'A',
    'A2':'A',
    'B1':'B',
    'B2':'B',
    'B3':'B',
    'C1':'C',
    'C2':'C',
}
data['upper']=data['food'].map(food2Upper)
data

  food  data food_map upper
0   A1     1        A     A
1   A2     2        A     A
2   B1     3        B     B
3   B2     4        B     B
4   B3     5        B     B
5   C1     6        C     C
6   C2     7        C     C

In [42]:
import numpy as np
df = pd.DataFrame({'data1':np.random.randn(5),
                  'data2':np.random.randn(5)})
df2=df.assign(ration=df['data1']/df['data2'])
df2

      data1     data2    ration
0 -0.528093 -1.154234  0.457527
1  0.451180  0.307002  1.469633
2  0.385603 -1.495582 -0.257828
3  0.228336 -1.426503 -0.160067
4 -0.495754 -0.204981  2.418538

In [44]:
df2.drop('ration',axis='columns',inplace=True)
df2

      data1     data2
0 -0.528093 -1.154234
1  0.451180  0.307002
2  0.385603 -1.495582
3  0.228336 -1.426503
4 -0.495754 -0.204981

In [46]:
data = pd.Series([1,2,3,4,5,6,7,8,9])
data

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [52]:
data.replace(9,np.nan,inplace=True)
data

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    8.0
8    NaN
dtype: float64

In [66]:
ages = [15,18,20,21,22,34,41,52,63,79]
bins=[10,40,80]
bins_res=pd.cut(ages,bins)
bins_res

[(10, 40], (10, 40], (10, 40], (10, 40], (10, 40], (10, 40], (40, 80], (40, 80], (40, 80], (40, 80]]
Categories (2, interval[int64, right]): [(10, 40] < (40, 80]]

In [78]:
# bins_res.labels
# pd.value_counts(bins_res)
# 区间的数量
pd.Series(bins_res).value_counts()

(10, 40]    6
(40, 80]    4
Name: count, dtype: int64

In [80]:
pd.cut(ages,[10,30,50,80])

[(10, 30], (10, 30], (10, 30], (10, 30], (10, 30], (30, 50], (30, 50], (50, 80], (50, 80], (50, 80]]
Categories (3, interval[int64, right]): [(10, 30] < (30, 50] < (50, 80]]

In [94]:
group_names=['Yonth','Mille','Old']
pd.Series(pd.cut(ages,[10,20,50,80],labels=group_names)).value_counts()
# pd.cut(ages,[10,20,50,80],labels=group_names)

Mille    4
Yonth    3
Old      3
Name: count, dtype: int64

In [104]:
df=pd.DataFrame([range(3),[0,np.nan,0],[0,0,np.nan],range(3)])
df

   0    1    2
0  0  1.0  2.0
1  0  NaN  0.0
2  0  0.0  NaN
3  0  1.0  2.0

In [106]:
df.isnull()

       0      1      2
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [108]:
df.isnull().any()#按列

0    False
1     True
2     True
dtype: bool

In [110]:
df.isnull().any(axis=1)#按行

0    False
1     True
2     True
3    False
dtype: bool

In [112]:
df.fillna(5) # 用5来填充缺失值

   0    1    2
0  0  1.0  2.0
1  0  5.0  0.0
2  0  0.0  5.0
3  0  1.0  2.0

In [120]:
df[df.isnull().any(axis=1)]
# 显示出带缺失值的行

   0    1    2
1  0  NaN  0.0
2  0  0.0  NaN